{"data":{"allContentfulBlogContentTextNode":{"edges":[{"node":{"id":"ab2d3da7-1b71-5258-8310-517e4734ad8f","internal":{"content":"This is a test for a new blog!"}}},{"node":{"id":"2c51c946-5307-5f70-bacb-309b83af17d9","internal":{"content":"On Day 63, I knew something was going on when I woke up. I got a mild headache, and runny nose. I thought it was just my hayfever acting up, so I went to school at 730am as usual. I was wrong, it only got worse..\n\nI started sneezing every 10 seconds (no kidding), I have to constantly go to the bathroom for more tissues. I managed to make it through 2 classes. Afterwards, I went to the coffee shop and coded until 7pm and went home. I felt really good that day, psychologically, because I persisted. I stick to my commitment even though I was ill. I know this might sound a bit dramatic, but I have never been that determined to school and coding. I would have given myself an excuse and slacked off for the rest of the day.\n\nDay 64 was much better. I had a really nice sleep from 10pm to 630am. I revisited my blog ('s code), I found out the blog posts were not sorted in order, so I did \n> this.state.post.sort((post1,post2) => {\n>   return post2.fields.order > post1.fields.order}).map ....\n \nYay, Javascript knowledge payed off (even though its probably trivial for most of the people :p).\n\nI am still trying to get a hang of Redux at the moment. In the next project, I will start using Redux and build a more complex web app. Meanwhile, I will keep reading and practicing my vanilla javascript. \n"}}},{"node":{"id":"e844dfa2-328f-53de-bc99-4e133ba2110f","internal":{"content":"First blog post on my own website! Hurray! I have no classes on Friday, so Friday is usually my dedicated coding day.(To be fair, whenever I have freetime I will either watch video about coding or actually code :p). I spent the day creating this blog. I know this is easy for a lot of people, but for a new programmer like me, I am extremely happy for this. I very much prefer simple and clean layout, that's why the blog does not look fancy at all. But it does the job(at least I think it does, for now)\nThe blog is not fully functional yet. This is by no means completed. There is still a lot to do on this blog. There are plenty of blog hosting websites, but it is much more satisfying to build one on my own. This is a fun little project that I will keep sticking to. At the moment , only blog, about page and error page are functional.\n\nTime log of today:\n\n__7pm : Woke up__\n\n__8pm - 11pm : Went for coffee, rearranged the layout of the blog.__\n\n__11pm - 12pm : Eat, relax__\n\n__12pm-3pm : Added reponsive design on the website. Read up how to do client-side routing.__\n\n__3pm - 3:45pm : Took a nap.__\n\n__3:45pm - 8:35pm : Continued learning how to properly route my website. Created an about page. Learnt how to publish it on github to show it to people__\n\nWhat I have to figure out/ do:\n\n__Complete the home page__\n\n__Ability to login to the website as admin.(possibly optional?)__\n\n__Make a text editor for the website (features like bold, set font-size etc. Or at the very least, set the blog post's title and type out the paragraph)__\n\n__Post , and store data on the website.__\n\n__Correctly route the blog posts (For instance blog/39 to day 39)__\n\n__I also want to create a timer app, it will be a fun little project.__\n\nTime to take a rest :)"}}},{"node":{"id":"0b1ad43a-f78a-5891-ba35-bb319c5560a8","internal":{"content":"Today I spent almost whole day playing with Django and Python. I followed Djangogirls' guide to build a blog with just Django. (Awesome guide btw, check it out! [Link](https://tutorial.djangogirls.org/en/) ) Initially, I looked up Django guide because I heard it can be used as backend in combination with React, and I wanted to learn more Python to prepare for next year's Python data structure class. I actually enjoyed writing in Django and Python! Codes written in Python just looks really clean. I also started reading 'Learning Python the hard way'. The idea of typing out all the code, without understanding it first is pretty interesting, and I can see it actually working. I am going to commit at least half an hour everyday reading it. I probably shouldn't wander around with other languages that much at this stage. I guess today was a more relaxing day where I get to explore a little bit, instead of grinding on JS, React and CSS. Still, I definitely think today is a fruitful day. I am glad I started coding, I am now absolutely hooked. I woke up at 7am and coded until just now (10pm), and I don't feel bored at all. I can't wait to start my next computer science class."}}},{"node":{"id":"34bb20ab-f0e9-5564-9f46-25cee6aa6e1d","internal":{"content":"Just started migrating Contentful API and my React blog. Now I am actually able to start using this blog! I can actually use a text editor instead of typing the blog with html tags like an idiot :p Next step is to link separate blog to separate url parameters. Hopefully it will be done tomorrow. \n\nSchool starts tomorrow .. again. It's gonna be 2 classes in 1 session again, because I wanna be as available as possible in my senior year, so I can focus more on coding. The more I do coding challenges, the more I realize how bad my fundamentals are, which is a good thing! I make a lot of stupid mistakes, but I am also learning in the process. This is one of my favorite thing about coding: there's always new things to learn, and the satisfaction of solving a problem you have been stuck is unparalleled :D"}}},{"node":{"id":"39439b91-9e7f-5503-a2d6-69c497ef6aef","internal":{"content":"Finally!\n\nI am finally able to wire up the React Router properly, so that it each seperate blog post will:\n1. grab the path name from Contentful\n2. Create a link on the Homepage, which links to mypage/blog/{day}\n3. Brings user to the right url, displaying only the blog post that was selected\n\nI feel so dumb when I finally figured out I wasn't passing any of the props from React Router to the blog page. I was wondering why it keeps saying my match. is not defined. Then I realized I forgot to pass it to the next component. \n\nWell, at least I learnt something :p Now I actually have a functional blog that I can use. Next step is to fix the side bar, so it will actually show what is the previous and next post. Then, I might move on to another projet I had in mind. In the next project, I am going to try and learn a backend language and actually implement a login system. I am excited to start it! \n\nI am going to head off and learn some more python(been fun so far btw), do some reading and sleep. This is what I love about programming: the feeling of finally solving a problem. No matter how dumb it looks in retrospect :p\n"}}}]}}}